tutorials/multiform/phaseFieldNavierStokesFoam/bubbleChannel/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}

sigma           0.0707106;

M              M [0 2 -1 0 0 0 0] 1;
epsilon        epsilon [0 1 0 0 0 0 0] 0.05626976975;
W0             W0 [0 0 0 0 0 0 0] 1;

freeEnergy
{
    a a [0 0 0 0 0 0 0] 1;
    b b [0 0 0 0 0 0 0] 1;
}


// ************************************************************************* //
