tutorials/multiform/phaseFieldNavierStokesFoam/bubbleChannel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        solver          PBiCG;
        preconditioner  diagonal;
        tolerance       1e-8;
        relTol          0;

        nAlphaCorr      1;
        nAlphaSubCycles 2;
        cAlpha          1;
    }



    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-07;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    UFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     3;
    nOuterCorrectors 5;
    nNonOrthogonalCorrectors 0;

    phaseFieldControls
    {
        maxNofCorrectors 10;
        alphaTol    1e-3;
        muTol       1e-3;
    }

    outerCorrectorResidualControl
    {
        alpha
        {
            tolerance 1e-5;
            relTol    0;
        }

        mu
        {
            tolerance 1e-5;
            relTol    0;
        }

    }

}

relaxationFactors
{
    equations
    {
        mu 1;
    }

    fields
    {
        alpha   0.8;
        alphaFinal 1;
        mu      1;
        muFinal 1;
    }

}



// ************************************************************************* //
